#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113602134197]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113602134210]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113602134200]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113602134194]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113602134204]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113602134203]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113602134195]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113602134199]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113602134198]
data.sakuracloud_archive.ubuntu_archive: Read complete after 3s [id=113601947038]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113602134196]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113602134201]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113602134212]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113602134205]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113602134209]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113602134218]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113602134213]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113602134206]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113602134215]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113602134223]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113602134211]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113602134216]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113602134214]
sakuracloud_vpc_router.k8s_internal_router: Refreshing state... [id=113602134224]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113602134240]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113602134238]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113602134239]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113602134265]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113602134254]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113602134263]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113602134252]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113602134249]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113602134250]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113602134251]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113602134253]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602134209" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113602134239" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602134212" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113602134240" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602134205" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113602134238" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602134215" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113602134254" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602134213" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113602134253" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602134211" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113602134250" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602134223" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113602134249" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602134218" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113602134265" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602134206" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113602134263" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602134214" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113602134251" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602134216" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113602134252" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602134209",
        ] -> (known after apply)
        id                = "113602134239"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602134212",
        ] -> (known after apply)
        id                = "113602134240"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602134205",
        ] -> (known after apply)
        id                = "113602134238"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602134215",
          - "113602134203",
        ] -> (known after apply)
        id                = "113602134254"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602134213",
          - "113602134199",
        ] -> (known after apply)
        id                = "113602134253"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602134211",
          - "113602134204",
        ] -> (known after apply)
        id                = "113602134250"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602134223",
          - "113602134201",
        ] -> (known after apply)
        id                = "113602134249"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602134218",
          - "113602134194",
        ] -> (known after apply)
        id                = "113602134265"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602134206",
          - "113602134196",
        ] -> (known after apply)
        id                = "113602134263"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602134214",
          - "113602134210",
        ] -> (known after apply)
        id                = "113602134251"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602134216",
          - "113602134200",
        ] -> (known after apply)
        id                = "113602134252"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 11 to add, 11 to change, 11 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>